{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Comparison",
    "1": "Economic_Indicator",
    "2": "Event_Impact",
    "3": "Explanatory",
    "4": "Navigation",
    "5": "Prediction",
    "6": "Sentiment_analysis",
    "7": "Valuation"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Comparison": 0,
    "Economic_Indicator": 1,
    "Event_Impact": 2,
    "Explanatory": 3,
    "Navigation": 4,
    "Prediction": 5,
    "Sentiment_analysis": 6,
    "Valuation": 7
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
